{
  "architectures": [
    "BartForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "bos_token_id": 0,
  "classif_dropout": 0.1,
  "classifier_dropout": 0.1,
  "d_model": 1024,
  "decoder_attention_heads": 16,
  "decoder_ffn_dim": 4096,
  "decoder_layerdrop": 0.0,
  "decoder_layers": 12,
  "dropout": 0.1,
  "encoder_attention_heads": 16,
  "encoder_ffn_dim": 4096,
  "encoder_layerdrop": 0.0,
  "encoder_layers": 12,
  "eos_token_id": 2,
  "forced_bos_token_id": 0,
  "forced_eos_token_id": 2,
  "gradient_checkpointing": false,
  "id2label": {
    "0": "codes_by_designation",
    "1": "delivery_status",
    "2": "order_supplier",
    "3": "fournisseurs_ice_001",
    "4": "user_material_assignment",
    "5": "equipment_requests_by_date",
    "6": "count_equipment_requests",
    "7": "liste_fournisseurs",
    "8": "fallback"
  },
  "init_std": 0.02,
  "is_encoder_decoder": true,
  "is_encoder_decoder": true,
  "label2id": {
    "codes_by_designation": 0,
    "delivery_status": 1,
    "order_supplier": 2,
    "fournisseurs_ice_001": 3,
    "user_material_assignment": 4,
    "equipment_requests_by_date": 5,
    "count_equipment_requests": 6,
    "liste_fournisseurs": 7,
    "fallback": 8
  },
  "max_position_embeddings": 1024,
  "model_type": "bart",
  "num_labels": 9,
  "pad_token_id": 1,
  "scale_embedding": false,
  "transformers_version": "4.30.0",
  "use_cache": true,
  "vocab_size": 50265
}
